; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 2.0.0
; 作者：YoYo
; 信箱：jkyoyo007@hotmail.com
;
; Updating translations:
;   Before updating a translation, please make sure you have the current development version of
;   	Universal Extractor by enabling the 'Install beta updates' option in preferences and searching
;   	for updates by clicking 'Check for Updates' in the help menu.
; 	Make sure to read the messages titled 'Breaking changes' - which can be found at
;		https://github.com/Bioruebe/UniExtract2/issues/2 - for a list of changes to already translated
;   	terms. Please compare the affected translations with the always up-to-date English language file
;		and edit them to reflect the changes.
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file. Simply delete the Homepage line if you don't have one. Credit
;		yourself in the ABOUT_INFO_LABEL term if you want to.
;	Save the file in Unicode format (UTF-16/UCS-2 Little Endian) and send it to the developers -
;		via Github: https://github.com/Bioruebe/UniExtract2/issues/2 or
;		per e-mail to the address listed at https://bioruebe.com/contact/
;
;	The following symbols have special meanings:
;	& 		  - when used in a GUI label or button, it precedes the letter that will be registered
;				as a hotkey. Each letter should only be used once per menu.
;	%name	  - will be replaced with 'Universal Extractor'
;	%n	 	  - indicates a newline character
;	%t	  	  - indicates a tab character
;	%1,%2,... - indicates a string variable that UniExtract will replace
;		The content of each %1,... variable is hardcoded into UniExtract.
;		The numbered variables' order can be switched to fit your language's word order
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "確定(&O)"
CANCEL_BUT = "取消(&C)"
YES_BUT = ""
NO_BUT = ""
DELETE_BUT = ""
COPY_BUT = ""
BATCH_BUT = ""
SEND_BUT = ""
NEXT_BUT = ""
PREV_BUT = ""
CLOSE_BUT = ""
EXIT_BUT = ""
CONTINUE_BUT = ""
FINISH_BUT = ""
ALWAYS_BUT = ""
NEVER_BUT = ""
CHECKBOX_REMEMBER = ""
CHECKBOX_DONT_ASK_AGAIN = ""
MAIN_DEST_DIR_LABEL = "目標資料夾(&D)："
MAIN_FILE_LABEL = "要解出的檔案或安裝程式(&A)："
MAIN_DIRECTORY_LOCK = ""
MAIN_DIRECTORY_LOCK_TOOLTIP = ""
MENU_FILE_LABEL = "檔案(&F)"
MENU_FILE_OPEN_LABEL = ""
MENU_FILE_KEEP_OPEN_LABEL = ""
MENU_FILE_SHOW_LABEL = ""
MENU_FILE_CLEAR_LABEL = ""
MENU_FILE_LOG_OPEN_LABEL = ""
MENU_FILE_LOG_FOLDER_OPEN_LABEL = ""
MENU_FILE_LOG_LABEL = ""
MENU_FILE_QUIT_LABEL = "結束(&Q)"
MENU_EDIT_LABEL = "編輯(&E)"
MENU_EDIT_SILENT_MODE_LABEL = ""
MENU_EDIT_PASSWORD_LABEL = ""
MENU_EDIT_CONTEXT_LABEL = ""
MENU_EDIT_PREFS_LABEL = "偏好設定(&P)"
MENU_HELP_LABEL = "說明(&H)"
MENU_HELP_FEEDBACK_LABEL = ""
MENU_HELP_PLUGINS_LABEL = ""
MENU_HELP_UPDATE_LABEL = ""
MENU_HELP_WEB_LABEL = "%1 站台(&W)"
MENU_HELP_GITHUB_LABEL = ""
MENU_HELP_STATS_LABEL = ""
MENU_HELP_PROGDIR_LABEL = ""
MENU_HELP_CONFIGFILE_LABEL = ""
MENU_HELP_ABOUT_LABEL = ""
PREFS_TITLE_LABEL = "偏好設定"
PREFS_UNIEXTRACT_OPTS_LABEL = "Universal Extractor 選項"
PREFS_HISTORY_LABEL = "保留封存檔的歷史記錄(&H)"
PREFS_UPDATEINTERVAL_LABEL = ""
PREFS_UPDATE_DAILY = ""
PREFS_UPDATE_WEEKLY = ""
PREFS_UPDATE_MONTHLY = ""
PREFS_UPDATE_YEARLY = ""
PREFS_UPDATE_NEVER = ""
PREFS_UPDATE_CUSTOM = ""
PREFS_FORMAT_OPTS_LABEL = "特定選項"
PREFS_LANG_LABEL = "語言(&L)："
PREFS_WARN_EXECUTE_LABEL = "執行檔案前提示警告(&W)"
PREFS_WARN_EXECUTE_TOOLTIP = ""
PREFS_CHECK_FREE_SPACE_LABEL = ""
PREFS_CHECK_FREE_SPACE_TOOLTIP = ""
PREFS_CHECK_UNICODE_LABEL = ""
PREFS_CHECK_UNICODE_TOOLTIP = ""
PREFS_APPEND_EXT_LABEL = "加入缺少的檔案副檔名(&A)"
PREFS_APPEND_EXT_TOOLTIP = ""
PREFS_HIDE_TRAY_LABEL = ""
PREFS_HIDE_STATUS_LABEL = ""
PREFS_HIDE_STATUS_FULLSCREEN_LABEL = ""
PREFS_HIDE_STATUS_FULLSCREEN_TOOLTIP = ""
PREFS_OPEN_FOLDER_LABEL = ""
PREFS_FEEDBACK_PROMPT_LABEL = ""
PREFS_FEEDBACK_PROMPT_TOOLTIP = ""
PREFS_WINDOW_POSITION_LABEL = ""
PREFS_SEND_STATS_LABEL = ""
PREFS_SEND_STATS_TOOLTIP = ""
PREFS_LOG_LABEL = ""
PREFS_VIDEOTRACK_LABEL = ""
PREFS_VIDEOTRACK_TOOLTIP = ""
PREFS_TOPMOST_LABEL = ""
PREFS_BETA_UPDATES_LABEL = ""
PREFS_SOURCE_FILES_LABEL = ""
PREFS_SOURCE_FILES_OPT_ASK = ""
PREFS_SOURCE_FILES_OPT_DELETE = ""
PREFS_SOURCE_FILES_OPT_KEEP = ""
PREFS_SOURCE_FILES_OPT_KEEP_TOOLTIP = ""
PREFS_DELETE_ADDITIONAL_FILES_LABEL = ""
PREFS_DELETE_ADDITIONAL_FILES_TOOLTIP = ""
FEEDBACK_TITLE_LABEL = ""
FEEDBACK_SYSINFO_LABEL = ""
FEEDBACK_OUTPUT_LABEL = ""
FEEDBACK_MESSAGE_LABEL = ""
FEEDBACK_PRIVACY_ACCEPT_LABEL = ""
FEEDBACK_PRIVACY_VIEW_LABEL = ""
CONTEXT_ENTRIES_LABEL = ""
CONTEXT_ENABLED_LABEL = ""
CONTEXT_ALL_USERS_LABEL = ""
CONTEXT_ADMIN_REQUIRED = ""
CONTEXT_FILE_ASSOC_LABEL = ""
CONTEXT_SIMPLE_RADIO = ""
CONTEXT_CASCADING_RADIO = ""
CONTEXT_CASCADING_RADIO_TOOLTIP = ""
UPDATE_ACTION_INSTALL = ""
UPDATE_STATUS_SEARCHING = ""
UPDATE_TERM_PROGRAM_FILES = ""
UPDATE_WHATS_NEW = ""
FIRSTSTART_TITLE = ""
FIRSTSTART_PAGES = ""
FIRSTSTART_PAGE1 = ""
FIRSTSTART_PAGE2 = ""
FIRSTSTART_PAGE3 = ""
FFMPEG_LICENSE_ACCEPT_LABEL = ""
FFMPEG_LICENSE_VIEW_LABEL = ""
FFMPEG_SELECT_LABEL = ""
FFMPEG_SELECT_TITLE = ""
STATS_HEADER_STATUS = ""
STATS_HEADER_TYPE = ""
STATS_STATUS_SUCCESS = ""
STATS_STATUS_FAILED = ""
STATS_STATUS_FILEINFO = ""
STATS_STATUS_UNKNOWN = ""
STATS_NO_DATA = ""
FILESCAN_TITLE = ""
ABOUT_INFO_LABEL = "原始版本由 %1%n版本 2.0.0 由 Bioruebe <%2>%n版本 %3 由 gvp9000%n%n以 %4 發布"
ABOUT_VERSION = ""
METHOD_ADMIN_RADIO = "%1 管理式安裝程式"
METHOD_EXTRACTION_RADIO = "%1 解壓縮"
METHOD_HEADER = "%1 解壓縮"
METHOD_RADIO_LABEL = "解出方式"
METHOD_SWITCH_RADIO = "%1 切換"
METHOD_NOT_INSTALLER_RADIO = ""
METHOD_TEXT_LABEL = "%name 支援以下解出 %1 檔案包的方式。但並沒有任何方式是 100% 可靠的；如果預設的模式無法正常作業，請重新執行 %2 並選擇其它的解出方式。"
METHOD_UNPACKER_RADIO = "%1 解包程式"
METHOD_GAME_LABEL = ""
METHOD_GAME_NOGAME = ""
METHOD_NOT_IN_LIST = ""
METHOD_FILE_SELECT_LABEL = ""
METHOD_EXTRACTOR_SELECT_LABEL = ""

; GUI control functions
EXTRACT_TO = "解出檔案到："
OPEN_FILE = "開啟檔案"
SELECT_FILE = "選擇檔案"
UPDATE_CURRENT = ""

; Common terms
TERM_ARCHIVE = "封存檔"
TERM_AUDIO = ""
TERM_COMPILED = ""
TERM_COMPRESSED = "壓縮檔"
TERM_CONTAINER = ""
TERM_DATABASE = ""
TERM_DISK_IMAGE = ""
TERM_DOWNLOAD = ""
TERM_DOWNLOADING = ""
TERM_EBOOK = "電子書"
TERM_ECARD = "電子卡片"
TERM_ENCODED = "編碼檔"
TERM_ENCRYPTED = ""
TERM_ERROR = ""
TERM_EXECUTABLE = ""
TERM_EXTRACT = ""
TERM_FILE = ""
TERM_GAME = ""
TERM_HELP = "說明檔"
TERM_HOTFIX = "快速修復"
TERM_IMAGE = "映像"
TERM_INSTALLED = ""
TERM_INSTALLER = "安裝程式"
TERM_LOADING = ""
TERM_MERGE_MODULE = ""
TERM_OVERALL_PROGRESS = ""
TERM_PACKAGE = "檔案包"
TERM_PAGE = ""
TERM_PATCH = "修補程式"
TERM_RECONSTRUCTED = ""
TERM_SCAN = ""
TERM_SCRIPT = ""
TERM_SFX = "自解壓縮檔"
TERM_STAGE = "階段"
TERM_TESTING = "正在測試"
TERM_TRANSLATION = ""
TERM_UNKNOWN = "未知的"
TERM_UNPACKED = "已解出"
TERM_UPDATER = "更新程式"
TERM_VIDEO = ""

; Status messages
SCANNING_FILE = "正在掃瞄檔案以判定檔案類型。"
SCANNING_EXE = "正在使用 %1 掃瞄檔案。"
EXTRACTING = "正在解出檔案："
INIT_WAIT = "正在等待安裝程式初始化。%n請稍候..."
SENDING_FEEDBACK = ""
INPUT_NEEDED = ""
SEARCHING_PASSWORD = ""
TESTING_PASSWORD = ""
MOVING_FILE = ""
RENAMING_FILES = ""
RENAMING_FILES_PROGRESS = ""
PROCESSING = ""
CLEANING_UP = ""

; Custom prompts
INIT_COMPLETE = "初始化 %1；請結束安裝程式，並按 [確定] 繼續。"
UNPACK_PROMPT = "這個檔案是以 %1 封裝的，但它無法被解出。%n%n這也許是因為檔案的類型不被支援，或者%n它裡頭並未包含可被解出的檔案。%n%n您仍要將它解包嗎？%n%n注意：解包後的檔案將被命名為：%n%2\%3_unpacked.%4"
UNPACK_FAILED = "錯誤：%1%n無法解出。"
UNPACK_AGAIN = ""
NSIS_BINFILES = ""
WARN_EXECUTE = "警告：要解出此類封裝的話，必需直接執行檔案。%n%n如果您打算繼續，以下指令將開始執行：%n%n%1%n%n如果您不確定這個檔案是否帶有惡意程式，那麼建%n議您取消這項操作。您仍要繼續嘗試解出檔案嗎？"
FEEDBACK_SUCCESS = ""
FEEDBACK_PROMPT = ""
FEEDBACK_PRIVACY = ""
FEEDBACK_OUTDATED = ""
FFMPEG_NEEDED = ""
PROGRAM_FILES_MISSING = ""
PLUGIN_MISSING = ""
UPDATE_PROMPT = ""
FILE_COPY = ""
FILE_DELETE = ""
BATCH_DUPLICATE = ""
NO_FREE_SPACE = ""
CONTEXT_DANGEROUS = ""
ELEVATION_REQUIRED = ""
ACCESS_DENIED = ""
MOVE_FAILED = ""

; Help text
HELP_TITLE = ""
HELP_USAGE_TITLE = ""
HELP_USAGE = ""
HELP_ARGUMENTS = "%n%n支援的引數："
HELP_SCAN = ""
HELP_FILENAME = "%n     filename%t要解出的檔名"
HELP_DESTINATION = "%n     destination%t解出到目標目錄"
HELP_SILENT = ""
HELP_BATCH = ""
HELP_TYPE = ""
HELP_SUB = "%n%n透過取代目標資料夾可以使 %n%name 解出的檔案到以檔名命名的子目錄中。"
HELP_LAST = ""
HELP_NOARGS = "%n%n不帶引數執行 %name 將提示使用者%n選擇檔案名稱和目標資料夾。"
HELP_MORE = ""
HELP_EXAMPLE_TITLE = ""
HELP_EXAMPLE = ""
HELP_DOCS_LINK = ""

; Warning messages
WARN_CONVERSION_FAILED = ""
WARN_MOVE_FAILED = ""

; Error messages
UNKNOWN_FILETYPE_TITLE = ""
UNKNOWN_FILETYPE = ""
INVALID_FILE = ""
INVALID_DIR = "%1%n無法建立。請選擇一個正確的目標資料夾。"
NO_HISTORY = ""
EXTRACT_FAILED = "%name 無法被解出。%n它似乎是被支援的 %1，但是仍解出失敗。%n請檢視記錄檔 %2 以取得更多資訊。%n%n請按 [確定] 立即檢視記錄檔，或按 [取消] 結束程式。"
NOT_PACKED = ""
DOWNLOAD_FAILED = ""
UPDATECHECK_FAILED = ""
UPDATE_FAILED = ""
UPDATE_NOADMIN = ""
FFMPEG_MOVE_FAILED = ""
FFMPEG_INVALID_FILE = ""
FEEDBACK_EMPTY = ""
FEEDBACK_ERROR = ""
FEEDBACK_PRIVACY_NOT_ACCETPED = ""
LICENSE_NOT_ACCEPTED = ""
BATCH_FINISH = ""
NOT_SUPPORTED_TITLE = ""
NOT_SUPPORTED = ""
MISSING_EXE = ""
EXTRACT_TIMEOUT = ""
WRONG_PASSWORD = ""
NO_FREE_SPACE_ERROR = ""
MISSING_PART = ""
PLUGIN_IMPORT_MISSINGFILES = ""
MISSING_DEFINITION = ""
OPEN_URL_FAILED = ""

; Plugin descriptions
PLUGIN_SUPPORTED_FILETYPES = ""
PLUGIN_ARC_CONV = ""
PLUGIN_ISCAB = ""
PLUGIN_THINSTALL = ""
PLUGIN_UNREAL = ""
PLUGIN_WINTERMUTE = ""
PLUGIN_CI = ""
PLUGIN_DGCA = ""
PLUGIN_BOOTIMG = ""
PLUGIN_IS5COMP = ""
PLUGIN_WOLF = ""
PLUGIN_EXTSIS = ""
PLUGIN_BITROCK = ""

; Context Menu integration
EXTRACT_FILES = "用 UniExtract 解出檔案(&F)"
EXTRACT_HERE = "用 UniExtract 解出至此(&H)"
EXTRACT_SUB = "用 UniExtract 解出到子目錄(&S)"
EXTRACT_LAST = ""
SCAN_FILE = ""

; Other
DIR_ADDITIONAL_FILES = ""

; Uninstaller
UNINSTALL = ""
UNINSTALL_TITLE = ""
UNINSTALL_LABEL = ""
UNINSTALL_REMOVE_LOGS = ""
UNINSTALL_REMOVE_USERDATA = ""
